{"title": "\"Congruent\" and \"Opposite\" Neurons: Sisters for Multisensory Integration and Segregation", "paper_id": "025b2500986a070ec5f5d4b0021a52e7e7aa67fc", "segments": [["025b2500986a070ec5f5d4b0021a52e7e7aa67fc_0", "Experiments reveal that in the dorsal medial superior temporal (MSTd) and the ventral intraparietal (VIP) areas, where visual and vestibular cues are integrated to infer heading direction, there are two types of neurons with roughly the same number. One is \"congruent\" cells, whose preferred heading directions are similar in response to visual and vestibular cues; and the other is \"opposite\" cells, whose preferred heading directions are nearly \"opposite\" (with an offset of 180 • ) in response to visual vs. vestibular cues. Congruent neurons are known to be responsible for cue integration, but the computational role of opposite neurons remains largely unknown. Here, we propose that opposite neurons may serve to encode the disparity information between cues necessary for multisensory segregation. We build a computational model composed of two reciprocally coupled modules, MSTd and VIP, and each module consists of groups of congruent and opposite neurons. In the model, congruent neurons in two modules are reciprocally connected with each other in the congruent manner, whereas opposite neurons are reciprocally connected in the opposite manner. Mimicking the experimental protocol, our model reproduces the characteristics of congruent and opposite neurons, and demonstrates that in each module, the sisters of congruent and opposite neurons can jointly achieve optimal multisensory information integration and segregation. This study sheds light on our understanding of how the brain implements optimal multisensory integration and segregation concurrently in a distributed manner.", "abstract", "abstract"], ["025b2500986a070ec5f5d4b0021a52e7e7aa67fc_1", "Our brain perceives the external world with multiple sensory modalities, including vision, audition, olfaction, tactile, vestibular perception and so on. These sensory systems extract information about the environment via different physical means, and they generate complementary cues (neural representations) about external objects to the multisensory areas. Over the past years, a large volume of experimental and theoretical studies have focused on investigating how the brain integrates multiple sensory cues originated from the same object in order to perceive the object reliably in an ambiguous environment, the so-called multisensory integration. They found that the brain can integrate multiple cues optimally in a manner close to Bayesian inference, e.g., integrating visual and vestibular cues to infer heading direction [1] and so on [2][3][4]. Neural circuit models underlying optimal multisensory integration have been proposed, including a centralized model in which a dedicated processor receives and integrates all sensory cues [5,6], and a decentralized model in which multiple local processors exchange cue information via reciprocal connections, so that optimal cue integration is achieved at each local processor [7].  [1], (C) from [13].\nHowever, multisensory integration is only half of the story of multisensory information processing, which works well when the sensory cues are originated from the same object. In cases where the sensory cues originate from different objects, the brain should segregate, rather than integrate, the cues. In a noisy environment, however, the brain is unable to differentiate the two situations at first sight. The brain faces a \"chicken vs. egg\" dilemma in multisensory integration: without first integrating multiple cues to eliminate uncertainty, the brain is unable to estimate the objects reliably to differentiate whether the cues are from the same or different objects; but once the cues are integrated, the disparity information between the cues is lost, and the brain can no longer discriminate objects clearly when the cues actually come from different objects. To solve this dilemma, here we argue that the brain needs to carry out multisensory integration and segregation concurrently in the early stage of information processing, that is, a group of neurons integrates sensory cues while another group of neurons extracts the cue disparity information, and the interplay between two networks determines the final action: integration vs. segregation. Concurrent processing has the advantage of achieving rapid object perception if the cues are indeed from the same object, and avoiding information loss if the cues are from different objects. Psychophysical data tends to support this idea, which shows that the brain can still sense the difference between cues in multisensory integration [8,9].\nWhat are the neural substrates of the brain to implement concurrent multisensory integration and segregation? In the experiments of integrating visual and vestibular cues to infer heading direction, it was found that in the dorsal medial superior temporal area (MSTd) and the ventral intraparietal area (VIP) which primarily receive visual and vestibular cues respectively, there exist two types of neurons displaying different cue integrative behaviors [1,10]. One of them is called \"congruent\" cells, since their preferred heading directions are similar in response to either a visual or a vestibular cue (Fig. 1A); and the other type is called \"opposite\" cells, since their preferred visual and vestibular directions are nearly \"opposite\" (with an offset of 180 • , half of the period of direction, Fig. 1B). Data analyses and modelling studies revealed that congruent neurons are responsible for cue integration [1,10,6,7]. However, the computational role of opposite neurons remains largely unknown, despite the fact that congruent and opposite neurons are comparably numerous in MSTd and VIP (Fig. 1C). Notably, the responses of opposite neurons hardly vary when a single cue is replaced by two congruent cues (i.e., no cue integration behavior), whereas their responses increase significantly when the disparity between visual and vestibular cues increases [11], indicating that opposite neurons may serve to extract the cue disparity information necessary for multisensory segregation. Motivated by the above experimental findings, we explore how multisensory integration and segregation are concurrently implemented in a neural system via sisters of congruent and opposite cells.", "Introduction", "introduction"], ["025b2500986a070ec5f5d4b0021a52e7e7aa67fc_2", "In reality, because of noise, the brain estimates stimulus information relying on ambiguous cues in a probabilistic manner. Thus, we formulate multisensory information processing in the framework of probabilistic inference. The present study mainly focuses on information processing at MSTd and VIP, where visual and vestibular cues are integrated/segregated to infer heading direction. However, the main results of this work are applicable to the processing of cues of other modalities.", "Probabilistic Model of Multisensory Information Processing", "introduction"], ["025b2500986a070ec5f5d4b0021a52e7e7aa67fc_3", "Because heading direction is a circular variable whose values are in range (−π, π], we adopt the von Mises distribution [14] (Supplementary Information Sec. 1). Compared with the Gaussian distribution, the von Mises distribution is more suitable and also more accurate to describe the probabilistic inference of circular variables, and furthermore, it gives a clear geometrical interpretation of multisensory information processing (see below).\nSuppose there are two stimuli s 1 and s 2 , each of which generates a sensory cue x m , for m = 1, 2 (visual or vestibular), independently. We call x m the direct cue of s m , and x l (l = m) the indirect cue to s m . Denote as p(x m |s m ) the likelihood function, whose form in von Mises distribution is\np(x m |s m ) = 1 2πI 0 (κ m ) exp [κ m cos(x m − s m )] ≡ M(x m − s m , κ m ),(1)\nwhere I 0 (κ) = (2π) −1 2π 0 e κ cos(θ) dθ is the modified Bessel function of the first kind and order zero. s m is the mean of the von Mises distribution, i.e., the mean value of x m . κ m is a positive number characterizing the concentration of the distribution, which is analogous to the inverse of the variance (σ −2 ) of Gaussian distribution. In the limit of large κ m , a von\nMises distribution M[x m − s m , κ m ] approaches to a Gaussian distribution N [x m − s m , κ −1 m ] (SI Sec. 1.2).\nFor small κ m , the von Mises distribution deviates from the Gaussian one (Fig. 2A).", "The von Mises distribution for circular variables", "introduction"], ["025b2500986a070ec5f5d4b0021a52e7e7aa67fc_4", "We introduce first a probabilistic model of Bayes-optimal multisensory integration. Experimental data revealed that our brain integrates sensory cues optimally in a manner close to Bayesian inference [2]. Assuming that noises in different channels are independent, the posterior distribution of two stimuli can be written according to Bayes' theorem as\np(s 1 , s 2 |x 1 , x 2 ) ∝ p(x 1 |s 1 )p(x 2 |s 2 )p(s 1 , s 2 ),(2)\nwhere p(s 1 , s 2 ) is the prior of the stimuli, which specifies the concurrence probability of a stimulus pair. As an example in the present study, we choose the prior to be\np(s 1 , s 2 ) = 1 2π M(s 1 − s 2 , κ s ) = 1 (2π) 2 I 0 (κ s ) exp [κ s cos(s 1 − s 2 )] .(3)\nThis form of prior favors the tendency for two stimuli to have similar values. Such a tendency has been modeled in multisensory integration [7,[15][16][17]. κ s determines the correlation between two stimuli, i.e., how informative one cue is about the other, and it regulates the extent to which two cues should be integrated. The fully integrated case, in which the prior becomes a delta function in the limit κ s → ∞, has been modeled in e.g., [4,5].\nSince the results for two stimuli are exchangeable, hereafter, we will only present the result for s 1 , unless stated specifically. Noting that p(s m ) = p(x m ) = 1/2π are uniform distributions, the posterior distribution of s 1 given two cues becomes\np(s 1 |x 1 , x 2 ) ∝ p(x 1 |s 1 ) p(x 2 |s 2 )p(s 2 |s 1 )ds 2 ∝ p(s 1 |x 1 )p(s 1 |x 2 ).(4)\nThe indirect cue x 2 is informative to s 1 via the prior p(s 1 , s 2 ). By using Eqs. (1,3) and under reasonable approximations (SI Sec. 1.4), we obtain\np(s 1 |x 2 ) ∝ p(x 2 |s 2 )p(s 2 |s 1 )ds 2 M (s 1 − x 2 , κ 12 ) ,(5)\nwhere A(κ 12 ) = A(κ 2 )A(κ s ) with A(κ) ≡ π −π cos(θ)e κ cos θ dθ/ π −π e κ cos θ dθ. Finally, utilizing Eqs. (1,5), Eq. (4) is written as\np(s 1 |x 1 , x 2 ) ∝ M(s 1 − x 1 , κ 1 )M(s 1 − x 2 , κ 12 ) = M(s 1 −ŝ 1 ,κ 1 ),(6)\nwhere the mean and concentration of the posterior given two cues are (SI Sec. 1.3)\ns 1 = atan2(κ 1 sin x 1 + κ 12 sin x 2 , κ 1 cos x 1 + κ 12 cos x 2 ),(7)\nκ 1 = κ 2 1 + κ 2 12 + 2κ 1 κ 12 cos(x 1 − x 2 ) 1/2 , (8\n)\nwhere atan2 is the arctangent function of two arguments (SI Eq. S17).\nEqs. (7,8) are the results of Bayesian integration in the form of von Mises distribution, and they are the criteria for us to judge whether optimal cue integration is achieved in a neural system.\nTo understand these optimality criteria intuitively, it is helpful to see their equivalence of the Gaussian distribution in the limit of large κ 1 , κ 2 and κ s . Under the condition x 1 ≈ x 2 , Eq. ( 8) is approximated to beκ 1 ≈ κ 1 + κ 12 (SI Sec. 2). Since κ ≈ 1/σ 2 when von Mises distribution is approximated as Gaussian one, Eq. ( 8) becomes\n1/σ 2 1 ≈ 1/σ 2 1 + 1/σ 2 12\n, which is the Bayesian prediction on Gaussian variance conventionally used in the literature [4]. Similarly, Eq. ( 7) is associated with the Bayesian prediction on the Gaussian mean [4].", "Multisensory integration", "introduction"], ["025b2500986a070ec5f5d4b0021a52e7e7aa67fc_5", "We introduce next the probabilistic model of multisensory segregation. Inspired by the observation in multisensory integration that the posterior of a stimulus given combined cues is the product of the posteriors given each cue (Eq.4), we propose that in multisensory segregation, the disparity D(s 1 |x 1 ; s 1 |x 2 ) between two cues is measured by the ratio of the posteriors given each cue, that is,\nD(s 1 |x 1 ; s 1 |x 2 ) ≡ p(s 1 |x 1 )/p(s 1 |x 2 ),(9)\nBy taking the expectation of log D over the distribution p(s 1 |x 1 ), we get the Kullback-Leibler divergence between the two posteriors given each cue. This disparity measure was also used to discriminate alternative moving directions in [18].\nInterestingly, by utilizing the property of von Mises distributions and the condition cos(s 1 +π −x 2 ) = − cos(s 1 − x 2 ), Eq. ( 9) can be rewritten as\nD(s 1 |x 1 ; s 1 |x 2 ) ∝ p(s 1 |x 1 )p(s 1 + π|x 2 ),(10)\nthat is, the disparity information between two cues is proportional to the product of the posterior given the direct cue and the posterior given the indirect cue but with the stimulus value shifted by π.\nBy utilizing Eqs. (1,5), we obtain\nD(s 1 |x 1 ; s 1 |x 2 ) ∝ M(s 1 − x 1 , κ 1 )M(s 1 + π − x 2 , κ 12 ) = M (s 1 − ∆ŝ 1 , ∆κ 1 ) ,(11)\nwhere the mean and concentration of the von Mises distribution are\n∆ŝ 1 = atan2(κ 1 sin x 1 − κ 12 sin x 2 , κ 1 cos x 1 − κ 12 cos x 2 ),(12)\n∆κ 1 = κ 2 1 + κ 2 12 − 2κ 1 κ 12 cos(x 1 − x 2 ) 1/2 . (13\n)\nThe above equations are the criteria for us to judge whether the disparity information between two cues is optimally encoded in a neural system.", "Multisensory segregation", "introduction"], ["025b2500986a070ec5f5d4b0021a52e7e7aa67fc_6", "A benefit of using the von Mises distribution is that it gives us a clear geometrical interpretation of multisensory information processing. A von Mises distribution M (s − x, κ) can be interpreted as a vector in a two-dimensional space with its mean x and concentration κ representing respectively the angle and length of the vector (Fig. 2B-C). This fits well with the circular property of heading direction. When the posterior of a stimulus is interpreted as a vector, the vector length represents the confidence of inference. Interestingly, under such a geometrical interpretation, the product of two von Mises distributions equals summation of their corresponding vectors, and the ratio of two von Mises distributions equals subtraction of the two vectors. Thus, from Eq. (4), we see that multisensory integration is equivalent to vector summation, with each vector representing the posterior of the stimulus given a single cue, and from Eq. (9), multisensory segregation is equivalent to vector subtraction (see Fig. 2D).\nOverall, multisensory integration and segregation transform the original two vectors, the posteriors given each cue, into two new vectors, the posterior given combined cues and the disparity between the two cues. The original two vectors can be recovered from their linear combinations. Hence, there is no information loss. The geometrical interpretation also helps us to understand multisensory information processing intuitively. For instance, if two vectors have a small intersection angle, i.e., the posteriors given each cue tend to support each other, the length of summed vector is long, implying that the posterior of cue integration has strong confidence; and the length of subtracting vector is short, implying that the disparity between two cues is small. If the two vectors have a large intersection angle, the interpretation becomes the opposite.", "Geometrical Interpretation of Multisensory Information Processing", "introduction"], ["025b2500986a070ec5f5d4b0021a52e7e7aa67fc_7", "We adopt a decentralized architecture to model multisensory information processing in the brain [7,19]. Compared with the centralized architecture in which a dedicated processor carries out all computations, the decentralized architecture considers a number of local processors communicating with each other via reciprocal connections, so that optimal information processing is achieved at each local processor distributively [7]. This architecture was supported by a number of experimental findings, including the involvement of multiple, rather than a single, brain areas in visual-vestibular integration [1,10], the existence of intensive reciprocal connections between MTSd and VIP [20,21], and the robustness of multisensory integration against the inactivation of a single module [22]. In a previous work [7], Zhang et al. studied a decentralized model for multisensory integration at MSTd and VIP, and demonstrated that optimal integration can be achieved at both areas simultaneously, agreeing with the experimental data. In their model, MSTd and VIP are congruently connected, i.e., neurons in one module are strongly connected to those having the similar preferred heading directions in the other module. This congruent connection pattern naturally gives rise to congruent neurons.\nSince the number of opposite neurons is comparable with that of congruent neurons in MSTd and VIP, it is plausible that they also have a computational role. It is instructive to compare the probabilistic models of multisensory integration and segregation, i.e., Eqs. (4) and (10). They have the same form, except that in segregation the stimulus value in the posterior given the indirect cue is shifted by π. Furthermore, since congruent reciprocal connections lead to congruent neurons, we hypothesize that opposite neurons are due to opposite reciprocal connections, and their computational role is to encode the disparity information between two cues. The decentralized model for concurrent multisensory integration and segregation in MSTd and VIP is shown in Fig. 3. ", "Neural Implementation of Multisensory Information Processing 4.1 The model Structure", "introduction"], ["025b2500986a070ec5f5d4b0021a52e7e7aa67fc_8", "Denote as u m,n (θ) and r m,n (θ) respectively the synaptic input and firing rate of a n-type neuron in module m whose preferred heading direction with respect to the direct cue m is θ. n = c, o represents the congruent and opposite cells respectively, and m = 1, 2 represents respectively MSTd and VIP. For simplicity, we assume that the two modules are symmetric, and only present the dynamics of module 1.\nThe dynamics of a congruent neuron in module 1 is given by\nτ ∂u 1,c (θ, t) ∂t = −u 1,c (θ, t) + π θ =−π W r (θ, θ )r 1,c (θ , t) + π θ =−π W c (θ, θ )r 2,c (θ , t) + I 1,c (θ, t), (14\n)\nwhere I 1,c (θ, t) is the feedforward input to the neuron. W r (θ, θ ) is the recurrent connection between neurons in the same module, which is set to be W r (θ, θ ) = J r ( √ 2πa) −1 exp −(θ − θ ) 2 /(2a 2 ) with periodic condition imposed, where a controls the tuning width of the congruent neurons. W c (θ, θ ) is the reciprocal connection between congruent cells in two modules, which is set to be\nW c (θ, θ ) = J c ( √ 2πa) −1 exp −(θ − θ ) 2 /(2a 2\n) . The reciprocal connection strength J c controls the extent to which cues are integrated between modules and is associated with the correlation parameter κ s in the stimulus prior (see SI Sec. 3.3).\nThe dynamics of an opposite neuron in module 1 is given by\nτ ∂u 1,o (θ, t) ∂t = −u 1,o (θ, t) + π θ =−π W r (θ, θ )r 1,o (θ , t) + π θ =−π W o (θ, θ )r 2,o (θ , t) + I 1,o (θ, t). (15\n)\nIt has the same form as that of a congruent neuron except that the pattern of reciprocal connections are given by\nW o (θ, θ ) = J c ( √ 2πa) −1 exp −(θ + π − θ ) 2 /(2a 2 ) = W c (θ + π, θ )\n, that is, opposite neurons between modules are oppositely connected by an offset of π. We choose the strength and width of the connection pattern W o to be the same as that of W c . This is based on the finding that the tuning functions of congruent and opposite neurons have similar tuning width and strength [12]. Note that all connections are imposed with periodic conditions.\nIn the model, we include the effect of inhibitory neurons through a divisive normalization to the responses of excitatory neurons [23], given by The feedforward input conveys the direct cue information to a module (e.g., the feedforward input to MSTd is from area MT which extracts the heading direction from optical flow), which is set to be\nr 1,n (θ, t) = 1 D u [u 1,n (θ, t)] 2 + ,(16)\nI 1,n (θ, t) = α 1 exp − (θ − x 1 ) 2 4a 2 + F α 1 exp − (θ − x 1 ) 2 8a 2 ξ 1 (θ, t)+I b + F I b 1,n (θ, t), (17\n)\nwhere α 1 is the signal strength, I b the mean of background input, and F the Fano factor. ξ 1 (θ, t) and 1,n (θ, t) are Gaussian white noises of zero mean with variance satisfying ξ m (θ, t)ξ m (θ , t ) = δ mm δ(θ−θ )δ(t−t ), m,n (θ, t) m ,n (θ , t ) = δ mm δ nn δ(θ−θ )δ(t−t ). The signal-associated noises ξ 1 (θ, t) to congruent and opposite neurons are exactly the same, while the background noises 1,n (θ, t) to congruent and opposite neurons are independent of each other. At the steady state, the signal drives the network state to center at the cue value x 1 , whereas noises induce fluctuations of the network state. Since we consider multiplicative noise with a constant Fano factor, the signal strength α m controls the reliability of cue m [5]. The exact form of the feedforward input is not crucial, as long as it has a uni-modal shape.", "The model dynamics", "introduction"], ["025b2500986a070ec5f5d4b0021a52e7e7aa67fc_9", "We first verify that our model reproduces the characteristics of congruent and opposite neurons. Figs. 4A&B show the tuning curves of a congruent and an opposite neuron with respect to either visual or vestibular cues, which demonstrate that neurons in our model indeed exhibit the congruent or opposite direction selectivity similar to Fig. 1.\nWe then investigate the mean population activities of our model under different cuing conditions. When only cue x 1 is applied to module 1, both the congruent and opposite neuronal networks in module 1 receive the feedforward input and generate bumps at x 1 (Fig. 4C). When only cue x 2 is applied to module 2, the congruent neuronal network at module 1 receives a reciprocal input and generates a bump at x 2 , whereas the opposite neuronal network receives an offset reciprocal input and generates a bump at x 2 + π (Fig. 4D). For the indirect cue x 2 , the neural activities it induces at module 1 is lower than that induced by the direct cue x 1 (Fig. 4C). When both cues are presented, the congruent neuronal network integrates the feedforward and reciprocal inputs, whereas the opposite neuronal network computes their disparity by integrating the feedforward inputs and the offset reciprocal inputs shifted by π (Fig. 4E). The two networks compete with each other via divisive normalization. Fig. 4F shows that when the disparity between cues is small, the activity of congruent neurons is higher than that of opposite neurons. With the increase of cue disparity, the activity of the congruent neuronal network decreases, whereas the activity of the opposite neurons increases. These complementary changes in activities of congruent and opposite neurons provide a clue for other parts of the brain to evaluate whether the cues are from the same or different objects [24].\nFinally, to verify whether Bayes-optimal multisensory information processing is achieved in our model, we check the validity of Eqs. ", "Results", "results"], ["025b2500986a070ec5f5d4b0021a52e7e7aa67fc_10", ". To obtain the Bayesian predictions for the network's estimate under combined cue condition (details in SI Sec. 4.3), the mean and concentration of that network's estimates under either single cue conditions are also measured, and then are substituted into Eqs. (7)(8). Comparisons between the measured mean and concentration of congruent networks in two modules and the corresponding theoretical predictions are shown in Fig. 4G&H, indicating an excellent fit, where each dot is the result under a particular set of parameters. Similarly, comparisons between the measured mean and concentration of opposite networks and the theoretical predictions (SI Sec. 4.3) are shown in Fig. 4I&J, indicating opposite neurons indeed implement multisensory segregation.", "4.2)", "results"], ["025b2500986a070ec5f5d4b0021a52e7e7aa67fc_11", "Over the past years, multisensory integration has received large attention in modelling studies, but the equally important issue of multisensory segregation has been rarely explored. The present study proposes that opposite neurons, which is widely observed at MSTd and VIP, encode the disparity information between sensory cues. We built a computational model composed of reciprocally coupled MSTd and VIP, and demonstrated that the characteristics of congruent and opposite cells naturally emerge from the congruent and opposite connection patterns between modules, respectively. Using the von Mises distribution, we derived the optimal criteria for integration and segregation of circular variables and found they have clear geometrical meanings: integration corresponds to vector summation while segregation corresponds to vector subtraction. We further showed that such a decentralized system can realize optimal cue integration and segregation at each module distributively. To our best knowledge, this work is the first modelling study unveiling the functional role of opposite cells. It has a far-reaching implication on multisensory information processing, that is, the brain can exploit sisters of congruent and opposite neurons to implement cue integration and segregation concurrently.\nFor simplicity, only perfectly congruent or perfectly opposite neurons are considered, but in reality, there are some portions of neurons whose differences of preferred visual and vestibular heading directions are in between 0 • and 180 • (Fig. 1C). We checked that those neurons can arise from adding noises in the reciprocal connections. As long as the distribution in Fig. 1C is peaked at 0 • and 180 • , the model can implement concurrent integration and segregation. Also, we have only pointed out that the competition between congruent and opposite neurons provides a clue for the brain to judge whether the cues are likely to originate from the same or different objects, without exploring how the brain actually does this. These issues will be investigated in our future work.", "Conclusion and Discussion", "results"]], "meta": {"conference": "NIPS", "year": 2016, "authors": "Wenhao  Zhang, He  Wang, K. Y. Michael Wong, Si  Wu"}}